### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd
import numpy as np

#load and read data, ensure correct filepath
raw_data = pd.read_csv("../data/purchase_data.csv")

In [3]:
#investigate data
raw_data.shape

(780, 7)

In [4]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Purchase ID  780 non-null    int64
 1   SN           780 non-null    object
 2   Age          780 non-null    int64
 3   Gender       780 non-null    object
 4   Item ID      780 non-null    int64
 5   Item Name    780 non-null    object
 6   Price        780 non-null    float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

In [5]:
raw_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [6]:
#rename columns
renamed_data = raw_data.rename(columns={"Purchase ID":"purchase_id", "Item ID":"item_id", "Item Name":"item"})

## Player Count

* Display the total number of players

In [7]:
player_count = len(renamed_data.SN.unique())
player_count

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [8]:
renamed_data.head(5)

,purchase_id,SN,Age,Gender,item_id,item,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [9]:
#Number of Unique Items
unique_items = len(renamed_data.item.unique())
unique_items

179

In [10]:
#average price of items
mean = np.round(renamed_data["Price"].mean(), (2)).astype(str)
avg_price = "$" + mean
avg_price

'$3.05'

In [11]:
#number of purchases
number_purchases = len(renamed_data.purchase_id)
number_purchases

780

In [12]:
#total revenue
rev = renamed_data["Price"].sum().astype(str) 
total_rev = "$"+ rev
total_rev

'$2379.77'

In [13]:
#create dataframe
purchase_data = {"Number of Unique Items":[unique_items],
                "Average Price": [avg_price],
                "Number of Purchases":[number_purchases],
                "Total Revenue":[total_rev]} 
purchase_analysis = pd.DataFrame(purchase_data)
purchase_analysis

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [14]:
renamed_data.head(5)

,purchase_id,SN,Age,Gender,item_id,item,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [15]:
#Count of Players by Gender
count_df = pd.DataFrame(renamed_data["Gender"].value_counts()).rename(columns={"Gender":"Total Count"})
count_df

                       Total Count
Male                           652
Female                         113
Other / Non-Disclosed           15

In [16]:
#Percentage Players by Gender
percentage_df = renamed_data["Gender"].value_counts(normalize=True).mul(100).round(2).astype(str) + '%'
percentage_df

Male                     83.59%
Female                   14.49%
Other / Non-Disclosed     1.92%
Name: Gender, dtype: object

In [17]:
gender_dem = pd.concat([count_df, percentage_df], axis=1).rename(columns={"Gender":"Percentage of Players"})
gender_dem

                       Total Count Percentage of Players
Male                           652                83.59%
Female                         113                14.49%
Other / Non-Disclosed           15                 1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [18]:
purchase_count = renamed_data.groupby(["Gender"])["purchase_id"].count().reset_index().rename(columns={"purchase_id":"Purchase Count"})
purchase_count

                  Gender  Purchase Count
0                 Female             113
1                   Male             652
2  Other / Non-Disclosed              15

In [19]:
purchase_value = renamed_data.groupby(["Gender"])["Price"].sum().reset_index().rename(columns={"Price":"Total Purchase Value"})
purchase_value

                  Gender  Total Purchase Value
0                 Female                361.94
1                   Male               1967.64
2  Other / Non-Disclosed                 50.19

In [20]:
mean_purchase_price = np.round(renamed_data.groupby(["Gender"])["Price"].mean().reset_index(), 2)
mean_purchase_price

                  Gender  Price
0                 Female   3.20
1                   Male   3.02
2  Other / Non-Disclosed   3.35

In [158]:
df = pd.DataFrame(renamed_data.groupby(["Gender"]).agg({"Price":['count','mean','sum']}).rename(columns={"count":"Total Count"}).round(2).reset_index())
df

                  Gender       Price
                         Total Count  mean      sum
0                 Female         113  3.20   361.94
1                   Male         652  3.02  1967.64
2  Other / Non-Disclosed          15  3.35    50.19

In [159]:
grouped = pd.DataFrame(renamed_data['Price'].groupby([renamed_data['Gender'], renamed_data['SN']]).sum()).reset_index()
grouped.head()

   Gender             SN  Price
0  Female    Adastirin33   4.48
1  Female  Aerithllora36   8.64
2  Female     Aethedru70   3.54
3  Female       Aidain51   3.45
4  Female      Aiduesu86   4.48

In [160]:
df2 = pd.DataFrame(grouped.groupby(['Gender'])['Price'].mean()).reset_index().round(2)
df2

                  Gender  Price
0                 Female   4.47
1                   Male   4.07
2  Other / Non-Disclosed   4.56

In [161]:
df_test = pd.DataFrame(pd.concat([df,df2],axis=1).drop(columns=['Gender']).values).rename(columns={0:'Gender',
                                                                 1:'Total Count',
                                                                2:'Avg Purchase Price',
                                                                3:'Total Purchase',
                                                                4:'Avg Total Purchase Per Person'})
df_test

,Gender,Total Count,Avg Purchase Price,Total Purchase,Avg Total Purchase Per Person
0,Female,113,3.2,361.94,4.47
1,Male,652,3.02,1967.64,4.07
2,Other / Non-Disclosed,15,3.35,50.19,4.56

In [95]:
#create dataframe
purchase_by_gender = df.join([df2]).drop(columns=['Gender'])
purchase_by_gender

,"(Gender, )","(Price, Total Count)","(Price, mean)","(Price, sum)",Price
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [96]:
print(list(purchase_by_gender.columns))

[('Gender', ''), ('Price', 'Total Count'), ('Price', 'mean'), ('Price', 'sum'), 'Price']

In [104]:
df3 = pd.DataFrame(purchase_by_gender[:].values).rename(columns={0:'Gender',
                                                                 1:'Total Count',
                                                                2:'Avg Purchase Price',
                                                                3:'Total Purchase',
                                                                4:'Avg Total Purchase Per Person'})
df3

,Gender,Total Count,Avg Purchase Price,Total Purchase,Avg Total Purchase Per Person
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [118]:
age_dem = pd.cut(renamed_data['Age'],8, labels=["<10", "10-14", "15-19","20-24","25-29","30-34","35-39","40+"]).value_counts()
age_dem

20-24    277
15-19    232
10-14     77
25-29     63
30-34     52
<10       39
35-39     33
40+        7
Name: Age, dtype: int64

In [136]:
df5 = pd.DataFrame(age_dem).reset_index().rename(columns={"index":"Age Group","Age":"Total Count"}).sort_values(by=['Age Group'], ascending=True)
df6 = df5.set_index('Age Group')
df6

           Total Count
Age Group
<10                 39
10-14               77
15-19              232
20-24              277
25-29               63
30-34               52
35-39               33
40+                  7

In [149]:
df7 = df6.apply(lambda x: 100 * x / float(x.sum())).rename(columns={"Total Count":"Percentage of Players"}).round(2).astype(str) + '%'
df7

          Percentage of Players
Age Group
<10                        5.0%
10-14                     9.87%
15-19                    29.74%
20-24                    35.51%
25-29                     8.08%
30-34                     6.67%
35-39                     4.23%
40+                        0.9%

In [150]:
age_demographics = pd.concat([df6, df7], axis=1)
age_demographics

           Total Count Percentage of Players
Age Group
<10                 39                  5.0%
10-14               77                 9.87%
15-19              232                29.74%
20-24              277                35.51%
25-29               63                 8.08%
30-34               52                 6.67%
35-39               33                 4.23%
40+                  7                  0.9%

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [174]:
#create bins
bins = [0,9,14,19,24,29,34,39,40]
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
df8 = pd.cut(renamed_data['Age'], 8, labels=group_names).value_counts()
df8

20-24    277
15-19    232
10-14     77
25-29     63
30-34     52
<10       39
35-39     33
40+        7
Name: Age, dtype: int64

In [176]:
df9 = pd.DataFrame(df8).sort_values()
df9

       Age
20-24  277
15-19  232
10-14   77
25-29   63
30-34   52
<10     39
35-39   33
40+      7

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80